## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/64340904/runs/235ee5b4-6d2f-4edf-8ed7-0bd99b29fa03).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_db_subnet_group.terrateam will be created
+   resource "aws_db_subnet_group" "terrateam" {
+       arn                     = (known after apply)
+       description             = "Managed by Terraform"
+       id                      = (known after apply)
+       name                    = "terrateam"
+       name_prefix             = (known after apply)
+       subnet_ids              = [
+           "subnet-0085bdbe865107b1c",
+           "subnet-00a526b7a66409054",
+           "subnet-09255a8ad2dc6e8e8",
        ]
+       supported_network_types = (known after apply)
+       tags_all                = (known after apply)
+       vpc_id                  = (known after apply)
    }

  # aws_rds_cluster.terrateam will be created
+   resource "aws_rds_cluster" "terrateam" {
+       allocated_storage                     = (known after apply)
+       apply_immediately                     = (known after apply)
+       arn                                   = (known after apply)
+       availability_zones                    = (known after apply)
+       backup_retention_period               = (known after apply)
+       ca_certificate_identifier             = (known after apply)
+       ca_certificate_valid_till             = (known after apply)
+       cluster_identifier                    = "terrateam-atlas"
+       cluster_identifier_prefix             = (known after apply)
+       cluster_members                       = (known after apply)
+       cluster_resource_id                   = (known after apply)
+       cluster_scalability_type              = (known after apply)
+       copy_tags_to_snapshot                 = false
+       database_insights_mode                = (known after apply)
+       database_name                         = "terrateam"
+       db_cluster_parameter_group_name       = (known after apply)
+       db_subnet_group_name                  = "terrateam"
+       db_system_id                          = (known after apply)
+       delete_automated_backups              = true
+       enable_global_write_forwarding        = false
+       enable_http_endpoint                  = false
+       enable_local_write_forwarding         = false
+       endpoint                              = (known after apply)
+       engine                                = "aurora-mysql"
+       engine_lifecycle_support              = (known after apply)
+       engine_mode                           = "serverless"
+       engine_version                        = "5.7.mysql_aurora.2.07.1"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       iam_roles                             = (known after apply)
+       id                                    = (known after apply)
+       kms_key_id                            = (known after apply)
+       master_password                       = (sensitive value)
+       master_password_wo                    = (write-only attribute)
+       master_user_secret                    = (known after apply)
+       master_user_secret_kms_key_id         = (known after apply)
+       master_username                       = (sensitive value)
+       monitoring_interval                   = (known after apply)
+       monitoring_role_arn                   = (known after apply)
+       network_type                          = (known after apply)
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       preferred_backup_window               = (known after apply)
+       preferred_maintenance_window          = (known after apply)
+       reader_endpoint                       = (known after apply)
+       skip_final_snapshot                   = true
+       storage_encrypted                     = (known after apply)
+       storage_type                          = (known after apply)
+       tags_all                              = (known after apply)
+       vpc_security_group_ids                = (known after apply)
+
       scaling_configuration {
+           auto_pause               = true
+           max_capacity             = 2
+           min_capacity             = 2
+           seconds_before_timeout   = 300
+           seconds_until_auto_pause = 300
+           timeout_action           = "RollbackCapacityChange"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
